W7D5/reddit_clone_app/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "R4_0MI8yv8DTInhneM9Uaw"], ["updated_at", "2021-06-25 18:22:54.728564"], ["id", 1]]