W7D5/reddit_clone_app/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_sub
    @current_sub = params[:sub_id].nil? ? Sub.find(@post.sub_id) : Sub.find(params[:sub_id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def sub_moderator
    @sub = Sub.find(params[:id])
    @sub_moderator = User.find(@sub.moderator_id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def post_author
    @post = Post.find(params[:id])
    @post_author = User.find(@post.author_id)