W7D5/reddit_clone_app/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @sub = Sub.find(params[:sub_id])
    @post.sub_id = params[:post][:sub_id]
    @post.author_id = params[:post][:author_id]
    if @post.save
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "helloagainboys"], ["url", ""], ["content", ""], ["sub_id", 2], ["author_id", 1], ["created_at", "2021-06-25 23:43:11.357351"], ["updated_at", "2021-06-25 23:43:11.357351"]]

  def update
    @post = Post.find(params[:id])
    @post.update(title: params[:post][:title], url: params[:post][:url], content: params[:post][:content])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "bananan"], ["updated_at", "2021-06-25 23:54:33.504113"], ["id", 8]]