W7D5/reddit_clone_app/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
  def show
    @sub = Sub.find(params[:id])
    @posts = Post.all.select { |post| post.sub_id == @sub.id }

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @sub = Sub.new
    @user = User.find(params[:user_id])

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["description", "testing subforum"], ["moderator_id", 1], ["created_at", "2021-06-25 21:08:04.313249"], ["updated_at", "2021-06-25 21:08:04.313249"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = params[:sub][:moderator_id]
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "helloss253e"], ["updated_at", "2021-06-25 23:40:53.526570"], ["id", 2]]
---
  def update
    @sub = Sub.find(params[:id])
    @sub.update(title: params[:sub][:title], description: params[:sub][:description], moderator_id: params[:sub][:moderator_id])