W7D5/reddit_clone_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "jay"], ["password_digest", "$2a$12$Y/PV/UfsYxo4OPekRKI9sOFPrHchmmpXWvfLzS5xHSecA2O4AZhpK"], ["updated_at", "2021-06-25 19:07:12.338422"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)