W7D5/reddit_clone_app/app/views/subs/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<ul>
  <li>Moderator: <%= User.find_by(id: @sub.moderator_id).username %></li>